Reports/КаждыйСКаждым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КаждыйСКаждым</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/КаждыйСКаждым/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
			
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить()

	Макет = Отчеты.КаждыйСКаждым.ПолучитьМакет(?(Режим = "1", "Отчет", "Шахматка"));
	// для отладки использовать
	//ЭтаОбработка = РеквизитФормыВЗначение("Отчет");	// или этот отчет
	//Макет = ЭтаОбработка.мВернутьМакет();
	// "обратно" после работы с макетом
	
	Запрос = Новый Запрос;
	
	Если Режим = "4" Тогда Возврат	КонецЕсли;	// under construction
	
	Если Режим = "1" Тогда
		
		Запрос.УстановитьПараметр("Сезон",		Сезон);
		Запрос.УстановитьПараметр("Команда",	?(Команда.Пустая(), Неопределено, Команда));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Команды.Кто КАК Кто,
		|	Игры.ГдеИгра КАК ГдеИгра,
		|	Игры.Тур КАК Тур,
		|	Игры.СКем КАК СКем,
		|	Игры.ВыигрОборот КАК Выигр,
		|	Игры.НичьиОборот КАК Ничьи,
		|	Игры.ПоражОборот КАК Пораж,
		|	Игры.МЗОборот КАК МЗ,
		|	Игры.МПОборот КАК МП,
		|	Игры.МЗОборот - Игры.МПОборот КАК РазнМячей,
		|	Игры.ОчкиОборот КАК Очки,
		|	Игры.ПОчкиОборот КАК ПотерОчки
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ИгрыОбороты.Кто КАК Кто,
		|		ИгрыОбороты.Кто.Представление КАК КтоПредставление
		|	ИЗ
		|		РегистрНакопления.Игры.Обороты(
		|				,
		|				,
		|				,
		|				Сезон = &Сезон
		|					И ВЫБОР
		|						КОГДА &Команда = НЕОПРЕДЕЛЕНО
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ Кто В (&Команда)
		|					КОНЕЦ) КАК ИгрыОбороты) КАК Команды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Игры.Обороты(, , , Сезон = &Сезон) КАК Игры
		|		ПО Команды.Кто = Игры.Кто
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГдеИгра,
		|	Очки УБЫВ,
		|	Выигр УБЫВ,
		|	РазнМячей УБЫВ,
		|	МЗ УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(Тур),
		|	СУММА(Выигр),
		|	СУММА(Ничьи),
		|	СУММА(Пораж),
		|	СУММА(МЗ),
		|	СУММА(МП),
		|	СУММА(РазнМячей),
		|	СУММА(Очки),
		|	СУММА(ПотерОчки)
		|ПО
		|	Кто,
		|	ГдеИгра";
		
		Результат = Запрос.Выполнить();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьКто = Макет.ПолучитьОбласть("Кто");
		ОбластьГдеИгра = Макет.ПолучитьОбласть("ГдеИгра");
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		
		ТабДок.Очистить();
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		ВыборкаКто = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Место = 1;
		Пока ВыборкаКто.Следующий() Цикл
			ОбластьКто.Параметры.Заполнить(ВыборкаКто);
			ОбластьКто.Параметры.Кто = ""+ВыборкаКто.Кто+" ("+Место+")";
			ТабДок.Вывести(ОбластьКто, ВыборкаКто.Уровень());
			
			ВыборкаГдеИгра = ВыборкаКто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГдеИгра.Следующий() Цикл
				ОбластьГдеИгра.Параметры.Заполнить(ВыборкаГдеИгра);
				ОбластьГдеИгра.Параметры.ГдеИгра = ?(ВыборкаГдеИгра.ГдеИгра=1, "Дома", "Выезд");
				ТабДок.Вывести(ОбластьГдеИгра, ВыборкаГдеИгра.Уровень());
				
				ВыборкаДетали = ВыборкаГдеИгра.Выбрать();
				
				Пока ВыборкаДетали.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
					ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
				КонецЦикла;
			КонецЦикла;
			Место = Место + 1;
		КонецЦикла;
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		ТабДок.ПоказатьУровеньГруппировокСтрок(1);
		ТабДок.ФиксацияСверху = 4;
		ТабДок.ФиксацияСлева = 4;
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		ТабДок.Вывести(ОбластьПодвал);
		
	Иначе	// вар-ты №№ 2-4
		
		ЗапросКК = Новый Запрос;
		ЗапросКК.Текст = "ВЫБРАТЬ
		                 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИгрыОбороты.Кто) КАК Команды
		                 |ИЗ
		                 |	РегистрНакопления.Игры.Обороты(, , , Сезон = &Сезон) КАК ИгрыОбороты";
		
		ЗапросКК.УстановитьПараметр("Сезон",		Сезон);
		Выборка = ЗапросКК.Выполнить().Выбрать();
		КолКоманд = 0;
		Если Выборка.Следующий() Тогда
			КолКоманд = Выборка.Команды;
		КонецЕсли; 

		Запрос.УстановитьПараметр("Сезон",		Сезон);
		Запрос.УстановитьПараметр("Режим",		Режим);
		Запрос.УстановитьПараметр("КолКоманд",	КолКоманд);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Команды.Кто КАК Кто,
		|	Игры.СКем КАК СКем,
		|	Игры.ГдеИгра КАК ГдеИгра,
		|	Игры.Тур КАК Тур,
		|	Игры.Круг КАК Круг,
		|	Игры.Счет КАК Счет,
		|	Игры.Выигр КАК Выигр,
		|	Игры.Ничьи КАК Ничьи,
		|	Игры.Пораж КАК Пораж,
		|	Игры.Очки КАК Очки,
		|	Игры.ПОчки КАК ПотерОчки,
		|	Игры.МЗ КАК МЗ,
		|	Игры.МП КАК МП,
		|	Игры.РазнМячей КАК РазнМячей
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Игры.Кто КАК Кто,
		|		Игры.Кто.Представление КАК КтоПредставление
		|	ИЗ
		|		РегистрНакопления.Игры КАК Игры
		|	ГДЕ
		|		Игры.Сезон = &Сезон) КАК Команды
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Игры.Кто КАК Кто,
		|			Игры.ГдеИгра КАК ГдеИгра,
		|			Игры.Тур КАК Тур,
		|			Игры.СКем КАК СКем,
		|			Игры.Счет КАК Счет,
		|			ВЫБОР
		|				КОГДА Игры.Тур > &КолКоманд - 1
		|					ТОГДА 2
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК Круг,
		|			Игры.Выигр КАК Выигр,
		|			Игры.Ничьи КАК Ничьи,
		|			Игры.Пораж КАК Пораж,
		|			Игры.МЗ КАК МЗ,
		|			Игры.МП КАК МП,
		|			Игры.Очки КАК Очки,
		|			Игры.ПОчки КАК ПОчки,
		|			Игры.МЗ - Игры.МП КАК РазнМячей
		|		ИЗ
		|			РегистрНакопления.Игры КАК Игры
		|		ГДЕ
		|			Игры.Сезон = &Сезон) КАК Игры
		|		ПО Команды.Кто = Игры.Кто
		|
		|УПОРЯДОЧИТЬ ПО
		|	"+?(Режим = "2", "ГдеИгра", "Круг")+",
		|	Очки УБЫВ,
		|	Выигр УБЫВ,
		|	РазнМячей УБЫВ,
		|	МЗ УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(Тур),
		|	СУММА(Выигр),
		|	СУММА(Ничьи),
		|	СУММА(Пораж),
		|	СУММА(Очки),
		|	СУММА(ПотерОчки),
		|	СУММА(МЗ),
		|	СУММА(МП),
		|	СУММА(РазнМячей)
		|ПО
		|	Кто,
		// не работает конструкция Выбор ...
		|	"+?(Режим = "2", "ГдеИгра", "Круг");
		
		Результат = Запрос.Выполнить();
		
		тзВрем = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам).Строки;
		масКоманд = тзВрем.ВыгрузитьКолонку("Кто");		// порядок мест
		тзВрем = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
		
		//;Возврат;
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
		
		ТабДок.Очистить();
		ТабДок.Вывести(ОбластьЗаголовок);
		ОбластьШапкаНачало		= Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
		ОбластьШапкаКолонка		= Макет.ПолучитьОбласть("ШапкаТаблицы|Колонка");
		ОбластьШапкаИтогиГде	= Макет.ПолучитьОбласть("ШапкаТаблицы|ИтогиГде");
		ОбластьШапкаИтогиКом	= Макет.ПолучитьОбласть("ШапкаТаблицы|ИтогиКом");
		ТабДок.Вывести(ОбластьШапкаНачало);
		
		тзКоманды = Новый ТаблицаЗначений;
		тзКоманды.Колонки.Добавить("Команда");
		
		Для сч = 1 По КолКоманд - ?(Режим = "4", 1, 0) Цикл
			
			преф = Формат(сч,"ЧЦ=2; ЧВН=");
			тзКоманды.Колонки.Добавить("Ком"+преф+"1");
			тзКоманды.Колонки.Добавить("Тур"+преф+"1");
			тзКоманды.Колонки.Добавить("Ком"+преф+"2");
			тзКоманды.Колонки.Добавить("Тур"+преф+"2");
		    // заполнить шапку
			ОбластьШапкаКолонка.Параметры.СКем = ?(Режим = "4", ""+сч+"  -  "+Строка(сч+КолКоманд-1)
					, ""+сч+". "+масКоманд[сч-1].Наименование);	// ПолноеНаименование
			ТабДок.Присоединить(ОбластьШапкаКолонка);
			
		КонецЦикла;         
		ТабДок.Присоединить(ОбластьШапкаИтогиГде);
		ТабДок.Присоединить(ОбластьШапкаИтогиКом);
		
		ВыборкаКто = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// подготовить тз для вывода результатов в "нужном" нам виде
		Пока ВыборкаКто.Следующий() Цикл  // команда

			стрТЗ = тзКоманды.Добавить();
			стрТЗ.Команда = ВыборкаКто.Кто;
			
			Верх = 0;
			
			ВыборкаГдеИгра = ВыборкаКто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГдеИгра.Следующий() Цикл	// Д-В / 1-2 круг
				
				ВыборкаДетали = ВыборкаГдеИгра.Выбрать();
				Верх = Верх + 1;
				
				Пока ВыборкаДетали.Следующий() Цикл
					
					СКем	= ВыборкаДетали.СКем;
					Очки	= ВыборкаДетали.Очки;	// 0-3
					
					Счет	= ВыборкаДетали.Счет;	//ВыборкаДетали.МЗ+"-"+ВыборкаДетали.МП;
					Тур		= ВыборкаДетали.Тур;
					// определить тек. место команды в табели (масКоманд)
					место = масКоманд.Найти(СКем) + 1;
					// верх. строка - 1-й круг, вторая - второй круг
					// домашние игры выделять фоном, исход - шрифтом

					Круг = Цел(Тур/КолКоманд)+1;
					// Режим:
					//		2)		верх - дома, низ - выезд
					//		3)		верх - первый, низ - 2й круг
					//		4)		верх - первый круг туры 1-15, низ - 16-30
					Если Режим = "2" Тогда
						префикс = обДополнитьСтроку(место, 2, "0")+ ВыборкаДетали.ГдеИгра;
					ИначеЕсли Режим = "3" Тогда
						префикс = обДополнитьСтроку(место, 2, "0")+ Строка(Круг);
					Иначе	
						префикс = обДополнитьСтроку(Тур%(КолКоманд - 1), 2, "0")+ Строка(Круг);
					КонецЕсли;
					стрТЗ["Ком"+префикс] = счет;
					стрТЗ["Тур"+префикс] = (ВыборкаДетали.ГдеИгра - 1) * 100 + Тур;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
        // тзКоманды готова
		
		// ***************************************************************************
		ПрефиксСтолбца			= "Широкий";
		ОбластьКтоНачало 		= Макет.ПолучитьОбласть(ПрефиксСтолбца + "Кто|Начало");
		ОбластьКтоКолонка 		= Макет.ПолучитьОбласть(ПрефиксСтолбца + "Кто|Колонка");
		ОбластьКтоИтогиГде 		= Макет.ПолучитьОбласть(ПрефиксСтолбца + "Кто|ИтогиГде");
		ОбластьКтоИтогиКом 		= Макет.ПолучитьОбласть(ПрефиксСтолбца + "Кто|ИтогиКом");
		ОбластьПустойКолонка 	= Макет.ПолучитьОбласть(ПрефиксСтолбца + "ПустойКто|Колонка");
		
		// вывести по группировкам запроса
		ВыборкаКто = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		сч = 0;
		//Индикатор = Элементы.Индикатор;
		//Индикатор.МаксимальноеЗначение = КолКоманд;
		//Индикатор.Значение = 0;
		
		ПустойЦвет			= Новый Цвет;
		КрасныйЦвет			= WebЦвета.Красный;
		ЦветСчетаОбычный	= WebЦвета.Шоколадный;
		ЦветСчетаПобеда		= WebЦвета.Красный;
		ЦветСчетаНичья		= WebЦвета.Зеленый;
		ЦветСчетаПоражение	= WebЦвета.СветлоГрифельноСиний;
		ЦветВыезднаяИгра	= WebЦвета.ТопленоеМолоко;
		
		Пока ВыборкаКто.Следующий() Цикл  // команда
			
			текКоманда = ВыборкаКто.Кто;
			тзСтрКоманда = тзКоманды.Получить(сч);
			
			сч = сч + 1; 
			Верх = 0;
			
			ОбластьКтоНачало.Параметры.Кто = текКоманда;
			ОбластьКтоНачало.Параметры.Место = ""+сч+".";
			ТабДок.Вывести(ОбластьКтоНачало);
			
			ВыборкаГдеИгра = ВыборкаКто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Индикатор.Значение = Индикатор.Значение + 1;
			
			// *** here *****************************************************************
			
			// сформировать полную строку результата
			// выборка ВыборкаГдеИгра необходима для получения итогов по Д/В (кругу)
			Пока ВыборкаГдеИгра.Следующий() Цикл	// 2 раза - 2 круга
				
				//ОбластьКтоИтогиВерх		= Макет.ПолучитьОбласть("ИтогиВерх");
				//ОбластьКтоИтогиНиз		= Макет.ПолучитьОбласть("ИтогиНиз");
				
				Верх = Верх + 1;
				Если Верх = 1 Тогда
					// заполнить только итоговый результат "верхней" половины
					ОбластьКтоИтогиГде.Параметры.Заполнить(ВыборкаГдеИгра);
					ОбластьКтоИтогиГде.Параметры.Тур
						= ВыборкаГдеИгра.Выигр + ВыборкаГдеИгра.Ничьи + ВыборкаГдеИгра.Пораж;
					//ОбластьКтоИтогиВерх.Параметры.Заполнить(ВыборкаГдеИгра);
				    Продолжить;
				КонецЕсли; 
				
				Для счч = 1 По КолКоманд-?(Режим ="4", 1, 0) Цикл
					
					Если сч = счч Тогда
						ТабДок.Присоединить(ОбластьПустойКолонка);
						Продолжить;
					КонецЕсли;
					
					Для Круг = 1 По 2 Цикл
						
						// !!! Круг=2 м.б. как выездом(Режим = 2), так и вторым кругом (Режим = 3)
						// и соотв. выводить во вторую строку будем либо выездные матчи либо 2й круг!!
						префикс = обДополнитьСтроку(счч, 2, "0") + Строка(Круг);
						
						Счет = тзСтрКоманда["Ком"+префикс];
						Тур = тзСтрКоманда["Тур"+префикс];
						
						Обл = ОбластьКтоКолонка.Область("СчетИТур"+Круг);
						Обл1 = ОбластьКтоКолонка.Область("Счет"+Круг);
						Обл2 = ОбластьКтоКолонка.Область("Тур"+Круг);
						
						ЦветФона	= ПустойЦвет;
						ЦветСчета	= ЦветСчетаОбычный;
						
						Если Режим = "4" Тогда
							Обл1.Примечание.Текст = "";
						КонецЕсли;
						
						ОбластьКтоКолонка.Параметры["Счет"+Круг] = обЧислоВСчет(Счет);
						
						Если Не ПустаяСтрока(Счет) Тогда	//<> Неопределено Тогда
							
							Если Режим = "3" И Тур>100 Тогда
								// (*режим 2*) определить д/в
								// (*режим 3*) определить круг (1й-2й)
								ЦветФона = ЦветВыезднаяИгра;
								
							ИначеЕсли Режим = "4" Тогда
								//Обл1.Примечание.Текст	= стр.СКем;
							КонецЕсли;
							
							Если Счет = 99 Тогда
								Ч1 = 0;	Ч2 = 0
							Иначе
								Ч1 = Цел(Счет/10);	
								Ч2 = Счет-Ч1*10;
							КонецЕсли;
							
							Если Ч1>Ч2 = 1 Тогда
								ЦветСчета = ЦветСчетаПобеда;
							ИначеЕсли Ч1 = Ч2 Тогда	
								ЦветСчета = ЦветСчетаНичья;
							Иначе
								ЦветСчета = ЦветСчетаПоражение;
							КонецЕсли;
							
						КонецЕсли;
						ОбластьКтоКолонка.Параметры["Тур"+Круг] = ?(Тур>100, Тур - 100, Тур);
						// на всю область
						//ОбластьКтоКолонка.ТекущаяОбласть.ЦветФона = ЦветФона;
						Обл.ЦветФона = ЦветФона;
						Обл1.ЦветТекста = ЦветСчета;
						//Если Круг = 2 Тогда
						//	Толщина = 1;
						//	Обл.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, Толщина);
						//Иначе 
						//	Толщина = 1;
						//	Обл.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Точечная, Толщина);
						//КонецЕсли;
						
					КонецЦикла; // Круг 1..2
					
					ТабДок.Присоединить(ОбластьКтоКолонка);
					
				КонецЦикла;	// КолКоманд
				
				
				//// итоги по кругу
				//Для Каждого пар Из ОбластьКтоИтогиГде.Параметры Цикл 
				//	//ОбластьКтоИтогиГде.Параметры.Установить(
				//КонецЦикла;	
				ОбластьКтоИтогиГде.Параметры.Выигр2 	= ВыборкаГдеИгра.Выигр;
				ОбластьКтоИтогиГде.Параметры.Ничьи2 	= ВыборкаГдеИгра.Ничьи;
				ОбластьКтоИтогиГде.Параметры.Пораж2 	= ВыборкаГдеИгра.Пораж;
				ОбластьКтоИтогиГде.Параметры.Тур2		= ВыборкаГдеИгра.Выигр + ВыборкаГдеИгра.Ничьи + ВыборкаГдеИгра.Пораж;
				ОбластьКтоИтогиГде.Параметры.МЗ2		= ВыборкаГдеИгра.МЗ;
				ОбластьКтоИтогиГде.Параметры.МП2 		= ВыборкаГдеИгра.МП;
				ОбластьКтоИтогиГде.Параметры.РазнМячей2 = ВыборкаГдеИгра.РазнМячей;
				ОбластьКтоИтогиГде.Параметры.Очки2 		= ВыборкаГдеИгра.Очки;
				ОбластьКтоИтогиГде.Параметры.ПотерОчки2 = ВыборкаГдеИгра.ПотерОчки;
				
				//ОбластьКтоИтогиНиз.Параметры.Заполнить(ВыборкаГдеИгра);
				ТабДок.Присоединить(ОбластьКтоИтогиГде);
				
				//Если Круг = 1 Тогда
				//	//ТабДок.Присоединить(ОбластьПКтоИтогиКом);
				//Иначе	
					ОбластьКтоИтогиКом.Параметры.Заполнить(ВыборкаКто);
					ОбластьКтоИтогиКом.Параметры.Тур
						= ВыборкаКто.Выигр + ВыборкаКто.Ничьи + ВыборкаКто.Пораж;
					//ОбластьКтоИтогиКом.ТекущаяОбласть.ГраницаСнизу.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная;
					ТабДок.Присоединить(ОбластьКтоИтогиКом);
				//КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;

		
		ТабДок.ФиксацияСверху	= 4;
		ТабДок.ФиксацияСлева	= 3;
		Если Режим = "3" Тогда
			ТабДок.Вывести(ОбластьПодвалТаблицы);
			ТабДок.Вывести(ОбластьПодвал);
		КонецЕсли;	
		
	КонецЕсли;



КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Тур.Дата КАК Дата
	|ИЗ
	|	Документ.Тур КАК Тур
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата
	Иначе
		Дата = ТекущаяДата()
	КонецЕсли;

	Сезон	= Константы.ТекущийСезон.Получить();
	
	// список выбора в реквизите формы
	Режим = 3;

КонецПроцедуры
